RIET/src/InformationRegisters/ExportClearanceEventsQueue/ExportClearanceEventsQueue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExportClearanceEventsQueue</name>
  <resources>
    <name>EventDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EventType</name>
    <type>
      <types>EnumRef.ClearanceEventsTypes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/ExportClearanceEventsQueue/ManagerModule.bsl
Процедура ЗарегистрироватьEventПриНеобходимости(Shipment, EventType, OldEventDate, NewEventDate, User) Экспорт
			
	TMSСервер.ЗарегистрироватьClearanceEventПриНеобходимости(СоздатьНаборЗаписей(), Shipment, EventType, OldEventDate, NewEventDate, User);
	
КонецПроцедуры

Функция ПолучитьТаблицуLastModifiedBefore(LastModifiedBefore) Экспорт
	
	// Возвращает таблицу данных регистра, у которых Last modified меньше указанной
	
	Если НЕ ЗначениеЗаполнено(LastModifiedBefore) Тогда
		ВызватьИсключение "Last modified before is empty!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("LastModifiedBefore", LastModifiedBefore);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ExportClearanceEventsQueue.EventType,
		|	ExportClearanceEventsQueue.EventDate,
		|	ExportClearanceEventsQueue.Shipment,
		|	ExportClearanceEventsQueue.User,
		|	ExportClearanceEventsQueue.User.Код КАК Alias
		|ИЗ
		|	РегистрСведений.ExportClearanceEventsQueue КАК ExportClearanceEventsQueue
		|ГДЕ
		|	ExportClearanceEventsQueue.LastModified < &LastModifiedBefore";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УдалитьЗапись(Shipment, EventType) Экспорт
	
	TMSСервер.УдалитьЗаписьClearanceEvent(СоздатьНаборЗаписей(), Shipment, EventType);
	
КонецПроцедуры
